# Business Understanding

## Business Problem

# Data Understanding

# Exploratory Data Analysis

# Conclusion

# Recomentations

# Next Steps

# More Information

In [1]:
# Bringing in the libraries I will use for this project
import pandas as pd
import numpy as np
import sqlite3

In [2]:
# Now let's go for the database file
import zipfile

In [3]:
! dir

 Volume in drive C has no label.
 Volume Serial Number is 5CDE-0ED8

 Directory of C:\Users\us\Documents\DT Flatiron Flex Course\phase_1\Microsoft_Film_Proposal

01/30/2023  01:29 PM    <DIR>          .
01/30/2023  01:29 PM    <DIR>          ..
01/11/2023  03:17 PM             3,304 .gitignore
01/09/2023  01:57 PM    <DIR>          .ipynb_checkpoints
01/26/2023  01:34 PM    <DIR>          Data
01/30/2023  01:29 PM            36,210 Notebook.ipynb
01/11/2023  03:30 PM               179 README.md
               3 File(s)         39,693 bytes
               4 Dir(s)  332,219,916,288 bytes free

In [4]:
conn = sqlite3.connect('Data\im.db')
cursor = conn.cursor()

In [5]:
! dir Data

 Volume in drive C has no label.
 Volume Serial Number is 5CDE-0ED8

 Directory of C:\Users\us\Documents\DT Flatiron Flex Course\phase_1\Microsoft_Film_Proposal\Data

01/26/2023  01:34 PM    <DIR>          .
01/26/2023  01:34 PM    <DIR>          ..
01/09/2023  11:47 AM            53,544 bom.movie_gross.csv.gz
12/20/2021  04:31 PM       169,443,328 im.db
01/09/2023  11:47 AM        67,149,708 im.db.zip
01/09/2023  11:47 AM           498,202 rt.movie_info.tsv.gz
01/09/2023  11:47 AM         3,402,194 rt.reviews.tsv.gz
01/09/2023  11:47 AM           827,840 tmdb.movies.csv.gz
01/09/2023  11:47 AM           153,218 tn.movie_budgets.csv.gz
               7 File(s)    241,528,034 bytes
               2 Dir(s)  332,219,916,288 bytes free

In [6]:
sql_tables = """
select name
from sqlite_master
where type='table'
"""

In [7]:
pd.read_sql(sql_tables, conn)

            name
0   movie_basics
1      directors
2      known_for
3     movie_akas
4  movie_ratings
5        persons
6     principals
7        writers

In [8]:
# Load the tables
directors = pd.read_sql("SELECT * FROM directors", conn)
known_for = pd.read_sql("SELECT * FROM known_for", conn)
movie_akas = pd.read_sql_query("SELECT * FROM movie_akas", conn)
movie_basics = pd.read_sql_query("SELECT * FROM movie_basics", conn)
movie_ratings = pd.read_sql_query("SELECT * FROM movie_ratings", conn)
persons = pd.read_sql_query("SELECT * FROM persons", conn)
principals = pd.read_sql_query("SELECT * FROM principals", conn)
writers = pd.read_sql_query("SELECT * FROM writers", conn)

In [9]:
directors.head()

    movie_id  person_id
0  tt0285252  nm0899854
1  tt0462036  nm1940585
2  tt0835418  nm0151540
3  tt0835418  nm0151540
4  tt0878654  nm0089502

In [10]:
df = pd.read_sql_query("SELECT * FROM directors", conn)

df.head()

    movie_id  person_id
0  tt0285252  nm0899854
1  tt0462036  nm1940585
2  tt0835418  nm0151540
3  tt0835418  nm0151540
4  tt0878654  nm0089502

In [11]:
# Now lets take a look at all the tables
directors.head()

    movie_id  person_id
0  tt0285252  nm0899854
1  tt0462036  nm1940585
2  tt0835418  nm0151540
3  tt0835418  nm0151540
4  tt0878654  nm0089502

In [ ]:
known_for.head()

In [ ]:
movie_akas.head()

In [ ]:
movie_basics.head()

In [12]:
movie_ratings.head()

     movie_id  averagerating  numvotes
0  tt10356526            8.3        31
1  tt10384606            8.9       559
2   tt1042974            6.4        20
3   tt1043726            4.2     50352
4   tt1060240            6.5        21

In [ ]:
persons.head()

In [ ]:
principals.head()

In [ ]:
writers.head()

In [ ]:
df = pd.read_sql_query("SELECT * FROM movie_basics", conn)

df.head()

In [ ]:
movie_basics.head()

In [ ]:
# query = """
# SELECT * 
# FROM movie_basics JOIN directors ON movie_basics.director_id = directors.director_id 
# JOIN known_for ON movie_basics.known_for_id = known_for.known_for_id 
# JOIN movie_akas ON movie_basics.movie_akas_id = movie_akas.movie_akas_id 
# JOIN movie_ratings ON movie_basics.movie_ratings_id = movie_ratings.movie_ratings_id 
# JOIN persons ON movie_basics.persons_id = persons.persons_id 
# JOIN principals ON movie_basics.principals_id = principals.principals_id 
# JOIN writers ON movie_basics.writers_id = writers.writers_id
# """
# cursor.execute(query)
# result = cursor.fetchall()

# for row in result:
#     print(row)

In [ ]:
# import pandas as pd

# movie_basics = pd.read_sql_query("SELECT * FROM movie_basics", conn)
# directors = pd.read_sql_query("SELECT * FROM directors", conn)
# known_for = pd.read_sql_query("SELECT * FROM known_for", conn)
# movie_akas = pd.read_sql_query("SELECT * FROM movie_akas", conn)
# movie_ratings = pd.read_sql_query("SELECT * FROM movie_ratings", conn)
# persons = pd.read_sql_query("SELECT * FROM persons", conn)
# principals = pd.read_sql_query("SELECT * FROM principals", conn)
# writers = pd.read_sql_query("SELECT * FROM writers", conn)

# #join all the tables
# df = movie_basics.merge(directors, on='director_id', how='left')
# df = df.merge(known_for, on='known_for_id', how='left')
# df = df.merge(movie_akas, on='movie_akas_id', how='left')
# df = df.merge(movie_ratings, on='movie_ratings_id', how='left')
# df = df.merge(persons, on='persons_id', how='left')
# df = df.merge(principals, on='principals_id', how='left')
# df = df.merge(writers, on='writers_id', how='left')

# print(df)

In [ ]:
movie_basics.head(146144)

In [13]:
movie_ratings.head(73856)

         movie_id  averagerating  numvotes
0      tt10356526            8.3        31
1      tt10384606            8.9       559
2       tt1042974            6.4        20
3       tt1043726            4.2     50352
4       tt1060240            6.5        21
...           ...            ...       ...
73851   tt9805820            8.1        25
73852   tt9844256            7.5        24
73853   tt9851050            4.7        14
73854   tt9886934            7.0         5
73855   tt9894098            6.3       128

[73856 rows x 3 columns]

In [ ]:
# This doesn't work
# pd.read_sql("""
# SELECT *
# FROM movie_ratings
# ORDER BY average_rating DESC
# LIMIT 25;
# """, conn)

In [14]:
query = "SELECT * FROM movie_ratings ORDER BY movie_ratings DESC LIMIT 25"
cursor.execute(query)
result = cursor.fetchall()

for row in result:
    print(row)

OperationalError: no such column: movie_ratings

In [ ]:
import pandas as pd

df = pd.read_sql_query("SELECT * FROM movie_ratings ORDER BY average_rating DESC LIMIT 25", conn)
print(df)

In [ ]:
movie_ratings.head(73856)

In [ ]:
df = pd.read_sql_query("SELECT * FROM movie_ratings ORDER BY average_rating DESC LIMIT 25", conn)

In [ ]:
print(df)

In [ ]:
! dir